Revit 2027 API
CitySet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual CitySetIterator ForwardIterator()
Public Overridable Function ForwardIterator As CitySetIterator
public:
virtual CitySetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> CitySetIterator
override ForwardIterator : unit -> CitySetIterator
Return Value
CitySetIterator
Returns a forward moving iterator to the set.
See Also
Reference
CitySet Class
Autodesk.Revit.DB Namespace